src/test/resources/responses/expected/ResponsePayment_200.json

{
  "data": {
    "data": {
      "pagination": {
        "totalNumberOfRecords": 2,
        "startIndex": 1,
        "pageSize": 100
      },
      "paymentDetails": [
        {
          "paymentId": "43a41567-865d-4910-9636-362cd95e408e",
          "payeeId": "1bc1cd53-4a86-41d4-a1ac-8775048deb64",
          "payorId": null,
          "parentAccountId": null,
          "payCurrency": "CAD",
          "payReceive": "PAY",
          "receiveCurrency": "USD",
          "specifiedAmount": 999999999,
          "specifiedCurrency": "USD",
          "createdBy": null,
          "createdOn": "2023-05-11T18:22:48.451",
          "categoryPurposeParty": null,
          "chargeAmount": null,
          "chargeBearerFlag": null,
          "chargeBearerType": null,
          "chargeCurrencyCode": null,
          "confirmationNumber": null,
          "exchangeRate": null,
          "externalPaymentId": null,
          "forwardingAgentAddressLine": null,
          "forwardingAgentCountryCode": null,
          "forwardingAgentCountrySubdivisionCode": null,
          "forwardingAgentFinInstitutionName": null,
          "forwardingAgentPostalCode": null,
          "forwardingAgentTownName": null,
          "fundingStatus": "PENDING",
          "initiatingPartyName": null,
          "instructionsCodeForBank": null,
          "instructionsForBank": null,
          "lastSanctionsCheckOn": null,
          "lastUpdatedOn": "2023-05-11T18:22:48.451",
          "paymentEndToEndTarnsactionId": null,
          "paymentInternalTransactionId": null,
          "paymentMethod": "WIRE",
          "paymentReference": null,
          "paymentReleaseStatus": null,
          "paymentTransactionServiceLevelParty": null,
          "paymentTransactionStatusCode": null,
          "paymentTransactionStatusId": null,
          "paymentTransactionStatusReasonCode": null,
          "paymentTransactionStatusReasonDesc": null,
          "purposeCode": "stri",
          "purposeDescription": "string",
          "receiverBic": null,
          "releaseStatus": "PENDING",
          "remittanceInformation": null,
          "remittanceType": null,
          "requestedExecutionDate": null,
          "sanctionsCheckPassed": null,
          "transactionAccountId": null,
          "validationPassed": null,
          "internalOrderId": "5f3c4e93-3fed-46f3-99cb-7d20ba57792d",
          "externalOrderId": null,
          "orderStatus": "PENDING",
          "releaseDate": null,
          "totalNumberOfTransactions": null,
          "totalAmountOfTransactions": null
        },
        {
          "paymentId": "5cc9b4e1-52e2-4163-98dd-c915aaccda92",
          "payeeId": "1bc1cd53-4a86-41d4-a1ac-8775048deb64",
          "payorId": null,
          "parentAccountId": null,
          "payCurrency": "CAD",
          "payReceive": "PAY",
          "receiveCurrency": "USD",
          "specifiedAmount": 999999999,
          "specifiedCurrency": "USD",
          "createdBy": null,
          "createdOn": "2023-05-11T18:22:48.451",
          "categoryPurposeParty": null,
          "chargeAmount": null,
          "chargeBearerFlag": null,
          "chargeBearerType": null,
          "chargeCurrencyCode": null,
          "confirmationNumber": null,
          "exchangeRate": null,
          "externalPaymentId": null,
          "forwardingAgentAddressLine": null,
          "forwardingAgentCountryCode": null,
          "forwardingAgentCountrySubdivisionCode": null,
          "forwardingAgentFinInstitutionName": null,
          "forwardingAgentPostalCode": null,
          "forwardingAgentTownName": null,
          "fundingStatus": "PENDING",
          "initiatingPartyName": null,
          "instructionsCodeForBank": null,
          "instructionsForBank": null,
          "lastSanctionsCheckOn": null,
          "lastUpdatedOn": "2023-05-11T18:22:48.451",
          "paymentEndToEndTarnsactionId": null,
          "paymentInternalTransactionId": null,
          "paymentMethod": "WIRE",
          "paymentReference": null,
          "paymentReleaseStatus": null,
          "paymentTransactionServiceLevelParty": null,
          "paymentTransactionStatusCode": null,
          "paymentTransactionStatusId": null,
          "paymentTransactionStatusReasonCode": null,
          "paymentTransactionStatusReasonDesc": null,
          "purposeCode": "stri",
          "purposeDescription": "string",
          "receiverBic": null,
          "releaseStatus": "PENDING",
          "remittanceInformation": null,
          "remittanceType": null,
          "requestedExecutionDate": null,
          "sanctionsCheckPassed": null,
          "transactionAccountId": null,
          "validationPassed": null,
          "internalOrderId": "5f3c4e93-3fed-46f3-99cb-7d20ba57792d",
          "externalOrderId": null,
          "orderStatus": "PENDING",
          "releaseDate": null,
          "totalNumberOfTransactions": null,
          "totalAmountOfTransactions": null
        }
      ],
      "payees": [
        {
          "id": "1bc1cd53-4a86-41d4-a1ac-8775048deb64",
          "createdBy": "string",
          "createdAt": "2023-05-11T18:22:28.299Z",
          "updatedBy": "string",
          "updatedAt": null,
          "customerTransactionAccountId": "Test",
          "payeeType": "INDIVIDUAL",
          "payeeSubType": [
            "string"
          ],
          "vendorId": "string",
          "bankPaymentCountry": "string",
          "bankAccountCurrency": "string",
          "deliveryMethod": [
            "DRAFT"
          ],
          "preferredDeliveryMethod": "DRAFT",
          "firstName": "string",
          "middleName": "string",
          "lastName": "string",
          "nickName": "string",
          "businessIndustry": "string",
          "businessName": "string",
          "employerName": "string",
          "localTradingName": "string",
          "favourite": true,
          "payeeValidationStatus": true,
          "payeeValidationStatusDescription": "string",
          "emailRecipients": [
            {
              "emailId": "string",
              "language": "string"
            }
          ],
          "contact": {
            "id": "77f26c9d-d31c-4d38-a7d0-37273850797e",
            "dateOfBirth": "20221205",
            "occupation": "string",
            "phoneNumber": "string",
            "phoneNumberType": "string",
            "contactFirstName": "string",
            "contactLastName": "string",
            "contactMiddleName": "string",
            "authorizedUser1": "string",
            "authorizedUser2": "string",
            "authorizedUser3": "string",
            "identification": {
              "id": "bdcaf69c-2234-4ad7-86cc-8c924e0dc2b9",
              "idDocumentType": "PASSPORT_NUMBER",
              "idDocumentNumber": "string",
              "nationality": "string",
              "businessIdDocument": "string",
              "businessIdType": "string"
            }
          },
          "address": {
            "id": "cd4a607c-a369-49f5-9c93-e1af88bd2646",
            "branchName": "string",
            "streetAddress1": "string",
            "streetAddress2": "string",
            "city": "string",
            "province": "string",
            "postalCode": "string",
            "country": "string"
          },
          "bankDetails": [
            {
              "id": "f8d9adcc-4d68-408a-9376-3d165cd2aa46",
              "createdBy": "string",
              "createdAt": "2023-05-11T18:22:28.299Z",
              "updatedBy": "string",
              "updatedAt": null,
              "bankName": "string",
              "bankAccountNumber": "string",
              "bankAccountType": "string",
              "routingCode": "string",
              "swiftCode": "string",
              "bankAccountNickName": "string",
              "bankAccountVendorId": "string",
              "bankAccountValidationStatus": true,
              "bankAccountValidationStatusDescription": "string",
              "achRoutingCode": "string",
              "taxId": "string",
              "intermediaryBank": {
                "id": "a31efa9c-5e30-4714-a926-b6f42e704747",
                "bankName": "string",
                "bankAccountNumber": "string",
                "swiftCode": "string",
                "country": "string"
              },
              "address": {
                "id": "b183aef6-bc52-4453-9f9d-6d7ae7edb52d",
                "branchName": "string",
                "streetAddress1": "string",
                "streetAddress2": "string",
                "city": "string",
                "province": "string",
                "postalCode": "string",
                "country": "string"
              },
              "paymentInformation": {
                "id": "0337d03d-a550-4753-9535-505aa0797ffc",
                "purposeOfPayment": "string",
                "forFurtherCredit": "string",
                "paymentReference": "string",
                "feeChargeType": "string",
                "purposeOfPaymentDescription": "string"
              }
            }
          ],
          "fileMetadata": [
            {
              "id": "c21bdad2-889d-49f6-b7e6-d7c377b37125",
              "createdBy": "string",
              "createdAt": "2023-05-11T18:22:28.300Z",
              "updatedBy": "string",
              "updatedAt": null,
              "attributeName": "string",
              "fileId": "string",
              "fileName": "string",
              "metadata": "string",
              "referenceId": "string"
            }
          ],
          "isPartialPayee": false
        }
      ]
    },
    "metadata": {
      "timestamp": "2023-05-16T14:48:22",
      "statusCode": 200,
      "statusDescription": "Success",
      "path": "/orders/customers/payment-details/batchGet",
      "errors": null,
      "correlationId": "b001384b-f0d7-43a1-bdca-e5626ec4faf6"
    }
  },
  "metadata": {
    "timestamp": "2023-05-16T14:48:22Z",
    "statusCode": 200,
    "statusDescription": "Success",
    "path": "/convera/payments",
    "errors": null,
    "correlationId": "c531ccfa-5281-463b-8869-342cd5d338c5"
  }
}